Table of Contents
 Class CssConversionBuilder
Namespace
IdeaStatiCa.PluginsTools.CrossSectionConversions
Assembly
IdeaStatiCa.Plugin.dll
public class CssConversionBuilder
Inheritance
object
CssConversionBuilder
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 CssConversionBuilder(IPluginLogger)
public CssConversionBuilder(IPluginLogger logger = null)
Parameters
logger IPluginLogger
Methods
 Build()
public CssConversions Build()
Returns
CssConversions
 Register(ICssConvertor)
public CssConversionBuilder Register(ICssConvertor convertor)
Parameters
convertor ICssConvertor
Returns
CssConversionBuilder
 Edit this page